/*ES6
        ECMAScript 6.0（以下简称 ES6）是 JavaScript 语言的下一代标准，
        已经在 2015 年 6 月正式发布了。
        它的目标，是使得 JavaScript 语言可以用来编写复杂的大型应用程序，成为企业级开发语言。
*/
/*ECMAScript 和JAVAScript关系
        前者是后者的规格，后者是前者的一种实现
        （另外的 ECMAScript 方言还有 JScript 和 ActionScript）。
        日常场合，这两个词是可以互换的。
*/
/*
ES6和JS2015的关系
        ES6 既是一个历史名词，也是一个泛指，含义是 5.1 版以后的 JavaScript 的下一代标准，
        涵盖了 ES2015、ES2016、ES2017 等等，
        而 ES2015 则是正式名称，特指该年发布的正式版本的语言标准。
*/
/*ES6中解构赋值
        对赋值运算符的扩展。
        一种针对数组或者对象进行模式匹配，然后对其中的变量进行赋值。
        在代码书写上简洁且易读，语义更加清晰明了；也方便了复杂对象中数据字段获取。
*/
/*两部分
        解构的源，解构赋值表达式的右边部分。
        解构的目标，解构赋值表达式的左边部分。
 */
/*数组 对象 字符串 函数参数 */
/*数组 */
/*对象 名字需相同 或者可起别名 若起别名 原名不可使用 */
/*字符串解构和数组相同 */
/*函数参数解构 给函数参数设定默认值 */